s1 = '01234'
s2 = '56789'
s3 = s1 + s2
print('s1=', s1, 's2=', s2, '執行s3 = s1 + s2後，s3為', s3)
s4 = s3*3
print('s3=', s3, '執行s4 = s3*3後，s4為', s4)
s = '0123456789'
print('s=', s, 's[0]=', s[0])
print('s=', s, 's[1]=', s[1])
print('s=', s, 's[-1]=', s[-1])
print('s=', s, 's[-2]=', s[-2])
print('s=', s, 's[:]=', s[:])
print('s=', s, 's[5:]=', s[5:])
print('s=', s, 's[-2:]=', s[-2:])
print('s=', s, 's[:5]=', s[:5])
print('s=', s, 's[:-2]=', s[:-2])
print('s=', s, 's[7:9]=', s[7:9])
print('s=', s, 's[-4:-1]=', s[-4:-1])
print('s=', s, 's[5:-2]=', s[5:-2])
print('s=', s, 's[2:10:2]=', s[2:10:2])
print('s=', s, 's[::-1]=', s[::-1])
print('s=', s, 's[-1::-1]=', s[-1::-1])
s = '春眠不覺曉，處處聞啼鳥。\n\
夜來風雨聲，花落知多少。\n\
\t作者"孟浩然" 詩名"春曉'
print(s)
